app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE (NAME like '%주방장%') ORDER BY ID ASC
SELECT  "items".* FROM "items" WHERE (NAME like '%주방장%') ORDER BY ID ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", -4]]
SELECT COUNT(*) FROM "items" WHERE (NAME like '%베이라스%')
---
    def find_by_name
        name = params[:NAME].strip
        type = params[:TYPE].strip
        page = params[:PAGE] || 1
        puts type
        items = Item.where("NAME like ?", "%#{name}%")
        items = items.where(TYPE: type) if type != "ALL"
        items = items.order("ID ASC").limit(PAGE_SIZE).offset((page.to_i - 1) * PAGE_SIZE)